arduino/ArduinoCore-mbed/boards.txt
##############################################################

nicla_vision.name=Arduino Nicla Vision
nicla_vision.build.core=arduino
nicla_vision.build.crossprefix=arm-none-eabi-
nicla_vision.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

nicla_vision.build.variant=NICLA_VISION
nicla_vision.build.mcu=cortex-m7
nicla_vision.build.fpu=-mfpu=fpv5-d16
nicla_vision.build.float-abi=-mfloat-abi=softfp
nicla_vision.build.extra_flags=
nicla_vision.build.architecture=cortex-m7
nicla_vision.build.board=NICLA_VISION
nicla_vision.build.ldscript=linker_script.ld
nicla_vision.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_vision.compiler.mbed.arch.define=
nicla_vision.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_vision.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_vision.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_vision.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_vision.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_vision.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_vision.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_vision.vid.0=0x2341
nicla_vision.pid.0=0x025f
nicla_vision.vid.1=0x2341
nicla_vision.pid.1=0x035f
nicla_vision.vid.2=0x2341
nicla_vision.pid.2=0x045f
nicla_vision.vid.3=0x2341
nicla_vision.pid.3=0x055f
nicla_vision.upload_port.0.vid=0x2341
nicla_vision.upload_port.0.pid=0x025f
nicla_vision.upload_port.1.vid=0x2341
nicla_vision.upload_port.1.pid=0x035f
nicla_vision.upload_port.2.vid=0x2341
nicla_vision.upload_port.2.pid=0x045f
nicla_vision.upload_port.3.vid=0x2341
nicla_vision.upload_port.3.pid=0x055f

nicla_vision.upload.tool=dfu-util
nicla_vision.upload.tool.default=dfu-util
nicla_vision.upload.protocol=
nicla_vision.upload.transport=
nicla_vision.upload.vid=0x2341
nicla_vision.upload.pid=0x035f
nicla_vision.upload.address=0x08040000
nicla_vision.upload.interface=0
nicla_vision.upload.use_1200bps_touch=true
nicla_vision.upload.wait_for_upload_port=true
nicla_vision.upload.native_usb=true
nicla_vision.upload.maximum_size=786432
nicla_vision.upload.maximum_data_size=523624

nicla_vision.debug.tool=gdb
nicla_vision.bootloader.tool=openocd
nicla_vision.bootloader.config=-f target/stm32h7x_dual_bank.cfg
nicla_vision.bootloader.programmer=-f interface/stlink.cfg
nicla_vision.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
nicla_vision.bootloader.file=NICLA_VISION/bootloader.elf
